import pytest

from src.widget import get_data, mask_account_card

# Тесты с использованием пераметризации


# Для mask_account_card
@pytest.mark.parametrize(
    "value, expected",
    [
        ("Карта 1111 1111 1111 1111", "Карта 1111 11** **** 1111"),
        ("Карта1111111111111111", "Карта 1111 11** **** 1111"),
        ("Visa 1111 1111 1111 1111", "Visa 1111 11** **** 1111"),
        ("1111 1111 1111 1111", "Неверный ввод"),
        ("Карта 1111 1111 1111", "Неверный ввод"),
        ("Карта 1111 1111 1111 1111 1111", "Неверный ввод"),
        ("", "Неверный ввод"),
        ("Carl Jonson", "Неверный ввод"),
        ("Счет 11111111111111111111", "Счет **1111"),
        ("Счет11111111111111111111", "Счет **1111"),
        ("Peppa", "Неверный ввод"),
        ("11111111111111111111", "Неверный ввод"),
        ("Счет 111", "Неверный ввод"),
        ("Счет 123456789123456789123456789", "Неверный ввод"),
        ("", "Неверный ввод"),
    ],
)
def test_mask_account_card(value: str, expected: str) -> None:
    assert mask_account_card(value) == expected


# Для get_data
@pytest.mark.parametrize(
    "value, expected",
    [
        ("2024-03-11T02:26:18.671407", "11.03.2024"),
        ("2024-03-11", "11.03.2024"),
        ("Tututu", "Неверный ввод"),
        ("", "Неверный ввод"),
    ],
)
def test_get_data(value: str, expected: str) -> None:
    assert get_data(value) == expected
